<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a pkg using the Arduino download, then uploads it to the JSS.
</string>
	<key>Identifier</key>
	<string>local.jss.Arduino</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>GROUP_NAME</key>
		<string>Update-Smart-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Arduino</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>The open-source Arduino Software (IDE) can be used with any Arduino board.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Arduino.png</string>

	</dict>
	<key>MinimumVersion</key>
	<string>1.8.6</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.pkg.Arduino</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.jps3.download.Arduino</key>
			<dict>
				<key>git_hash</key>
				<string>93e084ba2317a79c198ab5808d1ea287757d1d72</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jps3-recipes/Arduino/Arduino.download.recipe</string>
				<key>sha256_hash</key>
				<string>2ad001a3b3478a8c57eac7fae4703fb0a4efdd4b148d587fc89dfbe98ee64507</string>
			</dict>
			<key>com.github.jps3.pkg.Arduino</key>
			<dict>
				<key>git_hash</key>
				<string>26464b3050757c504594f8aa5f30fbf07b99f011</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jps3-recipes/Arduino/Arduino.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>c49b0275c1878aba1f5ceedc06e360d882fb5f609cd465246839ce7d93c3d212</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
