<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>renames the SophosCloud pkg to include the version</string>
	<key>Identifier</key>
	<string>com.github.ruphysics.pkg.SophosCloud</string>
	<key>ParentRecipe</key>
    <string>com.github.ruphysics.download.SophosCloud</string>

	<key>Input</key>
	<dict>
                <key>NAME</key>
                <string>SophosCloudInstaller</string>
                <key>DEVICE_GROUP</key>
                <string>GROUP_NAME_FROM_CLOUD_CONSOLE</string>
                <key>APP_FILENAME</key>
                <string>Sophos Installer.app</string>
				<key>PKG_ID_PREFIX</key>
				<string>ca.torontomu.physics</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/%APP_FILENAME%/Contents/Info.plist</string>
 			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>




		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/%APP_FILENAME%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/%APP_FILENAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Sophos Installer Components</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/Sophos Installer Components</string>
			</dict>
		</dict>



		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash

###################################################################################################
# Script Name:  install_app.sh
# Originally By:  Zack Thompson / Created:  2/7/2018
# Version:  1.3 / Updated:  4/4/2018 / By:  ZT
# Version: 1.4 / Revised: 2023-05-10 / By: MF
#
# Description:  This script installs all the packages that are contained in this package.
#
###################################################################################################


echo "*****  Install %NAME% process:  START  *****"

if [[ $3 != "/" ]]; then
	echo "ERROR:  Target disk is not the startup disk."
	echo "*****  Install Tracker process:  FAILED  *****"
	exit 1
fi


# Set working directory
	pkgDir=$(/usr/bin/dirname "${0}")


chmod a+x $pkgDir/Sophos\ Installer.app/Contents/MacOS/Sophos\ Installer
chmod a+x $pkgDir/Sophos\ Installer.app/Contents/MacOS/tools/com.sophos.bootstrap.helper

# Install using CLI installer
exitText=$(sudo $pkgDir/Sophos\ Installer.app/Contents/MacOS/Sophos\ Installer --quiet --products antivirus intercept --devicegroup "%DEVICE_GROUP%")
exitStatus=$?

if [ ! -d /Applications/Sophos ]; then
	exitText+=$'\n\nERROR: missing /Applications/Sophos'
	exitStatus+=55
fi


if [[ $exitStatus == 0 ]]; then
	echo "%NAME% has been installed!"
else
	echo "ERROR:  Failed to install %NAME% code:$exitStatus:"
	echo "ERROR Contents:  $(echo ${exitText} | /usr/bin/xargs)"
	echo "*****  Install %NAME% process:  FAILED  *****"
	exit 2
fi

echo "*****  Install %NAME% process:  COMPLETE  *****"

exit 0</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array/>
					<key>id</key>
					<string>%PKG_ID_PREFIX%.%NAME%-%version%.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%version%-%DEVICE_GROUP%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>



		

		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
                	<array>
                    	<string>%RECIPE_CACHE_DIR%/unpack</string>
                    	<string>%RECIPE_CACHE_DIR%/Scripts</string>
                    	<string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    </array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>



	</array>
</dict>
</plist>
