<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>custom build based on various templates</string>
	<key>Description</key>
	<string>Downloads the latest version of Sophos cloud installer</string>
	<key>Identifier</key>
	<string>com.github.ruphysics.download.SophosCloud</string>
	<key>Input</key>
	<dict>
                <key>NAME</key>
                <string>SophosCloudInstaller</string>
                <key>URL</key>
                <string>https://URL_FROM_SOPHOS_CONSOLE/SophosInstall.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/</string>
 			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Sophos Installer.app</string>
				<key>requirement</key>
            	<string>identifier "com.sophos.macendpoint.Sophos-Installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2H5GFH3774"</string>
 			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		
	</array>
</dict>
</plist>
