<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>renames the SophosCloud pkg to include the version</string>
	<key>Identifier</key>
	<string>com.github.ruphysics.pkg.SophosCloud</string>
	<key>ParentRecipe</key>
    <string>com.github.ruphysics.download.SophosCloud</string>

	<key>Input</key>
	<dict>
                <key>NAME</key>
                <string>SophosCloud</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Sophos Installer.app/Contents/Info.plist</string>
 			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>

        <dict>
        	<key>Arguments</key>
            <dict>
            	<key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.zip</string>
                <key>source_pkg</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>


		
<!-- TODO copy .zip as payload, run script; modify install plist / script based on Group in Sophos tennant? -->

		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
                	<array>
                    	<string>%RECIPE_CACHE_DIR%/unpack</string>
                    </array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>



	</array>
</dict>
</plist>
