<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest verison of Matlab from a local file share.
need to set:
 ML_RELEASE - version of matlab ie R2021a
 INSTALLER_INPUT - unattended install fall; requires file-install-key set inside here and all other options
 SOURCE_DMG - location of this release 
 LICENSE_DAT - valid license.dat for network file OR empty file for user activation; file must exist!
	</string>
	<key>Identifier</key>
	<string>com.github.ruphysics.pkg.Matlab</string>
	<key>Input</key>
	<dict>
		<key>ML_RELEASE</key>
		<string>R?????</string>
		<key>INSTALLER_INPUT</key>
		<string>%RECIPE_DIR%/installer_input_%ML_RELEASE%.txt</string>
		<key>LICENSE_DAT</key>
		<string>%RECIPE_DIR%/license.dat</string>
		<key>SOURCE_DMG</key>
		<string>matlab.dmg</string>
		<!-- version is extra text ie build_date version (20250617.1) or custom string (u2-physics_standard) -->
		<key>version</key>
		<string></string>
		<key>update</key>
		<string></string>
        <key>ARCH_JSS</key>
        <string>arm64</string>

	
		<key>NAME</key>
		<string>Matlab %ML_RELEASE%%update% %ARCH_JSS%</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.ruphysics.download.Matlab</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		
		<dict>
			<key>Processor</key>
			<string>com.github.mforrest-rye.autopkg-recipes.matlab-custom/ExpandMatlab</string>
			<key>Arguments</key>
			<dict>
				<key>ml_dmg</key>
				<string>%SOURCE_DMG%</string>
				<key>ml_dir</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/ml-installer</string>
			</dict>
		</dict>


		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%INSTALLER_INPUT%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/installer_input.txt</string>
				<key>overwrite</key>
				<true/>				
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%LICENSE_DAT%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/license.dat</string>
				<key>overwrite</key>
				<true/>				
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash

###################################################################################################
# Script Name:  install_MatLab.sh
# By:  Zack Thompson / Created:  3/6/2017
# Version:  1.6 / Updated:  3/29/2018 / By:  ZT github.com/autopkg/MLBZ521-recipes
# Version: 1.8 / Updated 18/6/2025 / By: mforrest@ryerson.ca
#
# Description:  This script installs MatLab.
#
###################################################################################################

echo "*****  Install Matlab process:  START  *****"

##################################################
# Define Variables

# Set working directory
pkgDir=$( /usr/bin/dirname "${0}" )
# Version that's being updated (this will be set by the autopkg process)
version="%ML_RELEASE%"

##################################################
# Bits staged...

# Install MatLab with option file.
echo "Installing Matlab..."


	# Inject license location to the installer.input file
	LANG=C /usr/bin/sed -Ei '' 's,(#)? ?licensePath=.*,'"licensePath=${pkgDir}/license.dat"',;s,.*outputFile=,#outputFile=,;s,.*(product.(GPU_Coder|Spreadsheet_Link)),#\1,' "${pkgDir}/installer_input.txt"

case $version in
	R2017a)
		# -mode silent did not work in the option file for me.
		exitStatus=$("${pkgDir}/install" -mode silent -inputFile "${pkgDir}/installer_input.txt")
		exitCode=$?
		;;
	R2017b)
		# I'm assuming all future version will be packaged in this manner...(/hoping)..?
		exitStatus=$("${pkgDir}/InstallForMacOSX.app/Contents/MacOS/InstallForMacOSX" -inputFile "${pkgDir}/installer_input.txt")
		exitCode=$?
		;;
	R2021a)
		# R2021a confirmed working
		echo version:$version
		echo install_cmd: "${pkgDir}/InstallForMacOSX.app/Contents/MacOS/InstallForMacOSX" -inputFile "${pkgDir}/installer_input.txt"

		exitStatus=$("${pkgDir}/InstallForMacOSX.app/Contents/MacOS/InstallForMacOSX" -inputFile "${pkgDir}/installer_input.txt")
		exitCode=$?
		;;

	*)
	    # starting R2024a? need to use different installers for intel vs arm
	    # matlab makes a horrible macOS cli installer; hacks below to work around their issues

		echo catchall version:$version
		ml_installer=$( /usr/bin/find ${pkgDir}/ -path "*/bin/mac*/MathWorksProductInstaller" )
			echo install_cmd: "${ml_installer}" -inputFile "${pkgDir}/installer_input.txt"
			#ls -l ${ml_installer}

			exitStatus=$("${ml_installer}" -inputFile "${pkgDir}/installer_input.txt")
			exitCode=$?
			
			if [ $exitCode == 0 ]; then
				chmod g+w "/Applications/MATLAB_${version}.app/licenses/"
			fi

		;;
esac

echo exitCode:$exitCode: exitStatus:$exitStatus:
#debug


if [[ $exitCode != 0 ]]; then
	echo "Exit Code:  ${exitCode}"
fi

if [[ $exitStatus == *"End - Unsuccessful"* ]]; then
	echo "ERROR:  Install failed!"
	echo "ERROR Content:  ${exitStatus}"
	echo "*****  Install Matlab process:  FAILED  *****"
	exit 1
fi

echo "Install complete!"
echo "*****  Install Matlab process:  COMPLETE  *****"

exit 0</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>Matlab %ML_RELEASE%%update% %ARCH_JSS%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>version</key>
					<string>%ML_RELEASE%%update%</string>
					<key>id</key>
					<string>com.mathworks.installer</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>scripts</key>
					<string>Scripts</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
					<string>%RECIPE_CACHE_DIR%/ml_cache</string>
					<string>%RECIPE_CACHE_DIR%/ml_cache.zip</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
