<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>
revised from: com.github.patgmac.pkg.outset
Downloads outset and renames with version. No repackaging done.
</string>
	<key>Identifier</key>
	<string>com.github.ruphysics.pkg.outset</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>outset</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.5</string>
	<key>ParentRecipe</key>
	<string>com.github.grahamgilbert.download.outset</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/root</string>
				<key>pkgdirs</key>
				<dict>
                    			<key>usr/local/outset/boot-every</key>
                    			<string>0770</string>
                    			<key>usr/local/outset/boot-once</key>
                    			<string>0770</string>
                    			<key>usr/local/outset/login-every</key>
                    			<string>0770</string>
                    			<key>usr/local/outset/login-once</key>
                    			<string>0770</string>
                    			<key>usr/local/outset/login-privileged-every</key>
                    			<string>0770</string>
                    			<key>usr/local/outset/login-privileged-once</key>
                    			<string>0770</string>
                    			<key>usr/local/outset/share</key>
                    			<string>0770</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>


		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/root</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/outset-%version%.component.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>

                <dict>
                        <key>Processor</key>
                        <string>PkgCreator</string>
                        <key>Arguments</key>
                        <dict>
                                <key>pkg_request</key>
                                <dict>
                                        <key>pkgname</key>
                                        <string>%NAME%-%version%</string>
                                        <key>pkgroot</key>
                                        <string>%RECIPE_CACHE_DIR%/root</string>
                                        <key>version</key>
                                        <string>%version%</string>
                                        <key>id</key>
                                        <string>com.github.outset</string>
                                        <key>options</key>
                                        <string>purge_ds_store</string>
                                        <key>scripts</key>
                                        <string>%RECIPE_CACHE_DIR%/pkgroot/outset-%version%.component.pkg/Scripts</string>
                                </dict>
                        </dict>
                </dict>

<!--
                <dict>
                        <key>Processor</key>
                        <string>PathDeleter</string>
                        <key>Arguments</key>
                        <dict>
                                <key>path_list</key>
                                <array>
                                        <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                                        <string>%RECIPE_CACHE_DIR%/Scripts</string>
                                </array>
                        </dict>
                </dict>
-->

	</array>
</dict>
</plist>
