<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Adapted from grahampugh-recipes.jamf.*-pkg-upload</string>
	<key>Identifier</key>
	<string>com.github.tmuphysics.jamf.Anaconda-pkg-upload</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Computer Science</string>
		<key>NAME</key>
		<string>Anaconda%PYTHON_MAJOR_VERSION%-%ARCH%</string>
		<key>ARCH</key>
		<string>x86_64 or arm64</string>
		<key>PKG_INSTALL_LOCATION</key>
		<string>/Users/Shared/anaconda3</string>
		<key>PYTHON_MAJOR_VERSION</key>
		<string>3</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;https\://repo\.(anaconda\.com|continuum\.io)/archive/Anaconda%PYTHON_MAJOR_VERSION%-(?P&lt;version&gt;[0-9.]+)-MacOSX-%ARCH%\.%INSTALLER_TYPE%)</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.pkg.Anaconda</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
	</array>
</dict>
</plist>
