<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>renames the GlobalProtect pkg to include the version</string>
	<key>Identifier</key>
	<string>com.github.ruphysics.pkg.GlobalProtect</string>
	<key>ParentRecipe</key>
    <string>com.github.ruphysics.download.GlobalProtect</string>

	<key>Input</key>
	<dict>
                <key>NAME</key>
                <string>GlobalProtect</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>purge_destination</key>
				<true/>

			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/gp.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>

		
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
                	<array>
                    	<string>%RECIPE_CACHE_DIR%/unpack</string>
                        <string>%RECIPE_CACHE_DIR%/payload</string>
                    </array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>

        <dict>
        	<key>Arguments</key>
            <dict>
            	<key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>source_pkg</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>



	</array>
</dict>
</plist>
