<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.ruphysics.pkg.Tracker</string>
	<key>Description</key>
	<string>Downloads the latest version of Tracker installer, sets permissions as executable, and creates a package.
	Copied from mlbz521 Anaconda pkg recipe
	</string>
	<key>Input</key>
	<dict>
		<key>TRACKER_RELEASE</key>
		<string>6</string>
		<key>NAME</key>
		<string>Tracker</string>
		<key>PKG_ID_PREFIX</key>
		<string>org.opensourcephysics.cabrillo</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.ruphysics.download.Tracker</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%APP_FILENAME%.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/%APP_FILENAME%.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash

###################################################################################################
# Script Name:  install_app.sh
# Originally By:  Zack Thompson / Created:  2/7/2018
# Version:  1.3 / Updated:  4/4/2018 / By:  ZT
# Version: 1.4 / Revised: 2023-05-10 / By: MF
#
# Description:  This script installs all the packages that are contained in this package.
#
###################################################################################################

echo "*****  Install app process:  START  *****"

if [[ $3 != "/" ]]; then
	echo "ERROR:  Target disk is not the startup disk."
	echo "*****  Install Tracker process:  FAILED  *****"
	exit 1
fi


# Set working directory
	pkgDir=$(/usr/bin/dirname "${0}")

# Get the name of the .sh file in the directory.
installScript=$(/bin/ls "${pkgDir}/%APP_FILENAME%.app/Contents/MacOS/install"*.sh)
echo "Running CLI install script..."




# Install using CLI installer
exitText=$("${installScript}" --mode "unattended")
exitStatus=$?

if [[ $exitStatus == 0 ]]; then
	echo "Tracker has been installed!"
else
	echo "ERROR:  Failed to install Tracker code:$exitStatus:"
	echo "ERROR Contents:  $(echo ${exitText} | /usr/bin/xargs)"
	echo "*****  Install Tracker process:  FAILED  *****"
	exit 2
fi

echo "*****  Install Tracker process:  COMPLETE  *****"

exit 0</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array/>
					<key>id</key>
					<string>%PKG_ID_PREFIX%.%NAME%-%TRACKER_RELEASE%.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>