<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Julia and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.ruphysics.jss.Julia</string>
	<key>Input</key>
	<dict>
                <key>RELEASE</key>
                <string>1.6</string>
                <!-- in May 2022, v1.6.x is LTS, v1.7.x is current, v1.8.x is beta -->
                <key>ARCHITECTURE</key>
                <string>mac64</string>
                <!-- use mac64 for intel; macaarch64 for M1 -->
                
                <key>APP_FILENAME</key>
                <string>Julia-%RELEASE%</string>
                <key>NAME</key>
                <string>Julia</string>
                <key>SEARCH_URL</key>
                <string>https://julialang.org/downloads/</string>
                <key>SEARCH_PATTERN</key>
                <string>https:\/\/[^\"]*/julia-%RELEASE%[^\"]*-%ARCHITECTURE%.dmg</string>


		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>GROUP_NAME</key>
		<string>Update-Smart-%APP_FILENAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Julia</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string></string>
		<key>SELF_SERVICE_ICON</key>
		<string>%RECIPE_DIR%/%NAME%.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ruphysics.pkg.Julia</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>jss_inventory_name</key>
				<string>%APP_FILENAME%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%APP_FILENAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>

