<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Empty recipe that simply uses the download recipe (as it downloads a pkg)</string>
	<key>Identifier</key>
	<string>com.github.ruphysics.pkg.dockutil</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.jessepeterson.download.dockutil</string>
	<key>Input</key>
	<dict/>
	<key>Process</key>
	<array>
	                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>pkg_path</key>
                                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                                <key>source_pkg</key>
                                <string>%pathname%</string>
                        </dict>
                        <key>Processor</key>
                        <string>PkgCopier</string>
                </dict>

	</array>
</dict>
</plist>
